create Table Tablica
(
	id int identity Primary key,
	fio nvarchar(50),
	predmet nvarchar(50),
	ush nvarchar(50),
	ball float
);

insert into Tablica
values ('Иванова', 'математика', 'лицей', 98.5), 
		('Петров', 'физика', 'лицей', 99),
		('Сидоров', 'математика', 'лицей', 88),
		('Полухина', 'физика', 'гимназия', 78), 
		('Матвеева', 'химия', 'лицей', 92),
		('Касимов', 'химия', 'гимназия', 68),
		('Нестеров', 'математика', 'гимназия', 81),
		('Авдеев', 'физика', 'лицей', 87),
		('Никитина', 'химия', 'лицей', 94),
		('Барышев', 'химия', 'лицей', 88)