create table Imena
(
	fio nvarchar(50),
	god int,
	summa int
);

insert into imena
values	('Иванов И.И.', 2011, 200),
		('Иванов И.И.', 2011, 500),
		('Иванов И.И.', 2012, 300),
		('Иванов И.И.', 2012, 600),
		('Иванов И.И.', 2013, 900),
		('Иванов И.И.', 2014, 500),
		('Иванов И.И.', 2014, 300),
		('Иванов И.И.', 2015, 100),
		('Петров П.П.', 2011, 100),
		('Петров П.П.', 2012, 200),
		('Петров П.П.', 2012, 300),
		('Петров П.П.', 2013, 100),
		('Петров П.П.', 2014, 300),
		('Петров П.П.', 2014, 100),
		('Сидоров С.С.', 2012, 100),
		('Сидоров С.С.', 2013, 1000),
		('Сидоров С.С.', 2014, 500),
		('Сидоров С.С.', 2014, 300),
		('Сидоров С.С.', 2015, 300)

select fio, [2011], [2012], [2013], [2014], [2015]
	from Imena
pivot(sum(summa) for god in ([2011], [2012], [2013], [2014], [2015]))
	as test_pivot