create Table Fakultet
(
	ABFak varchar(2) primary key,
	NFak varchar(50)
)

insert into Fakultet
values	('ГН', 'Гуманнитарные Науки'),
		('Ен', 'Естественные Науки'),
		('ИТ', 'Информационные Технологии'),
		('Фн', 'ФИзкио Математический')

create Table Kafedra
(
	ShifrKaf varchar(2) primary key,
	NKaf varchar(50),
	AbFak_Kaf varchar(2)
)

insert into Kafedra
values	('вм', 'Высшая Математика', 'ен'),
		('ис', 'Информационные Системы', 'ит'),
		('мм', 'Математическое Моделирование', 'фм'),
		('оф', 'Общая Физкиа', 'фм'),
		('пи', 'Прикладная Математика', 'ит'),
		('эф', 'Экспериментальная Физика', 'фм')

create table Sotrudnik
(
	TablNom int primary key,
	ShifrKaf_Sotr varchar(2),
	FIO varchar(20),
	Dolgn varchar(30),
	zarplata money,
	TabNom_ruk int
)

insert into Sotrudnik
values	(101, 'пи', 'Прохоров', 'зав.кафедрой', 3500, 101),
		(102, 'пи', 'Семенов', 'преподаватель', 2500, 101),
		(105, 'пи', 'Петров', 'преподаватель', 2500, 101),
		(153, 'пи', 'Сидорова', 'инженер', 1500, 102),
		(201, 'ис', 'Андреев', 'зав.кафедрой', 3500, 201),
		(202, 'ис', 'Борисов', 'преподаватель', 2500, 201),
		(241, 'ис', 'Глухов', 'инженер', 2000, 201),
		(242, 'ис', 'Чернов', 'инженер', 1500, 202),
		(301, 'мм', 'Басов', 'зав.кафедрой', 3500, 301),
		(302, 'мм', 'Сергеева', 'преподаватель', 2500, 301),
		(401, 'оф', 'Волкв', 'зав.кафедрой', 3500, 401),
		(402, 'оф', 'Зайцев', 'преподаватель',2500 , 401),
		(403, 'оф', 'Смирнов', 'преподаватель', 1500, 401),
		(435, 'оф', 'Лисик', 'инженер', 2000, 402),
		(501, 'вм', 'Кузнецов', 'зав.кафедрой', 3500, 501),
		(502, 'вм', 'Романцев', 'преподаватель', 2500, 501),
		(503, 'вм', 'Соловьев', 'преподаватель', 2500, 501),
		(601, 'эф', 'Зверев', 'зав.кафедрой', 3500, 601),
		(602, 'эф', 'Сорокина', 'преподаватель', 2500, 601),
		(614, 'эф', 'Григорьев', 'инженер', 2000, 602)

create table Spezialn
(
	NSpez nvarchar(8) primary key,
	NaprSpez varchar(50), 
	Shifr_Spez varchar(2)
)

insert into Spezialn
values	('01.03.04', 'Прикладная Математика', 'мм'),
		('09.03.02', 'Информационные системы и технологии', 'ис'),
		('14.03.02', 'Ядерная физика и технологии', 'иф'),
		('38.03.05', 'Бизнес информатика', 'ис'),
		('09.09.03', 'Прикладная информатика', 'пи')

create table Predmet
(
	kod_pred int primary key,
	kol int,
	predmet varchar(20),
	ispolnitel_kaf varchar(2)
)

insert into Predmet
values	(101, 320, 'Математика', 'вм'),
		(102, 160, 'Информатика', 'пи'),
		(103, 160, 'Физика', 'оф'),
		(202, 120, 'База данных', 'ис'),
		(204, 160, 'Электроника', 'эф'),
		(205, 80, 'Программирование', 'пи'),
		(209, 80, 'Моделирование', 'мм')

create table Zakaz
(
	N_Z nvarchar(8),
	Kod_Z int
)

insert into Zakaz
values	('01.03.04', 101),
		('01.03.04', 205),
		('01.03.04', 209),
		('09.03.02', 101),
		('09.03.02', 102),
		('09.03.02', 103),
		('09.03.02', 202),
		('09.02.03', 205),
		('09.02.03', 209),
		('09.03.03', 101),
		('09.03.03', 102),
		('09.03.03', 103),
		('09.03.03', 205),
		('09.03.03', 202),
		('14.03.02', 101),
		('14.03.02', 102),
		('14.03.02', 103),
		('14.03.02', 204),
		('38.03.05', 101),
		('38.03.05', 103),
		('38.03.05', 202),
		('38.03.05', 209)

create table ZavKaf
(
	TabNom_K int primary key,
	St_K int
)

insert into ZavKaf
values	(101, 15),
		(201, 18),
		(301, 20),
		(401, 10),
		(501, 18),
		(601, 8)

create table Ingener
(
	TablNom_IN int primary key,
	Spez varchar(20),
)

insert into Ingener
values	(153, 'электроник'),	
		(241, 'электроник'),
		(242, 'программист'),
		(435, 'электроник'),
		(614, 'программист')

create table Prepodavatel
(
	TabNom_Pr int,
	Zvanie varchar(20),
	Stepen varchar(10)
)

insert into Prepodavatel
values	(101, 'профессор', 'д.т.н.'),
		(102, 'доцент', 'к.ф.-м.н.'),
		(105, 'доцент', 'к.т.н.'),
		(201, 'профессор', 'д.ф.-м.н.'),
		(202, 'доцент', 'к.ф.-м.н.'),
		(301, 'профессор', 'д.т.н.'),
		(302, 'доцент', 'к.т.н.'),
		(401, 'профессор', 'д.т.н.'),
		(402, 'доцент', 'к.т.н.'),
		(403, 'ассистен', ''),
		(501, 'профессор', 'д.ф.-м.н.'),
		(502, 'профессор', 'д.ф.-м.н.'),
		(503, 'доцент', 'к.ф.-м.н.'),
		(601, 'профессор', 'д.ф.-м.н.')

create table Student
(
	Reg_Nom int,
	Nom_SpeZ_St nvarchar(8),
	Fio_stud varchar(20)
)

insert into Student
values	(10101, '09.03.03', 'Николаева'),
		(10102, '09.03.03', 'Иванов'),
		(10103, '09.03.03', 'Крюков'),
		(20101, '09.03.03', 'Андреев'),
		(20102, '09.03.03', 'Федоров'),
		(30101, '14.03.02', 'Бондаренко'),
		(30102, '14.03.02', 'Цветков'),
		(30103, '14.03.02', 'Петров'),
		(50101, '01.03.04', 'Сергеев'),
		(50102, '01.03.04', 'Кудрявцев'),
		(80101, '38.03.05', 'Макаров'),
		(80102, '38.03.05', 'Яковлев')

create table Ozenka
(
	data date,
	kod int,
	RegNom int,
	Tab_Nom int,
	Auditoria nvarchar(4),
	Ozenk_a int
)

insert into Ozenka
values	('2022-06-05', 102, 10101, 102, 'т505', 4),
		('2022-06-05', 102, 10102, 102, 'т505', 4),
		('2022-06-05', 202, 20101, 202, 'т506', 4),
		('2022-06-05', 202, 10102, 202, 'т506', 3),
		('2022-06-07', 102, 30101, 105, 'ф419', 3),
		('2022-06-07', 102, 30102, 101, 'т506', 4),
		('2022-06-07', 102, 80101, 1002, 'м425', 5),
		('2022-06-09', 205, 80102, 402, 'м424', 4),
		('2022-06-09', 209, 20101, 302, 'ф333', 3),
		('2022-06-10', 101, 10102, 501, 'т506', 4),
		('2022-06-10', 204, 30102, 601, 'ф349', 5),
		('2022-06-10', 209, 80101, 301, 'э105', 5),
		('2022-06-10', 209, 80102, 301, 'э105', 5),
		('2022-06-12', 101, 80101, 502, 'с324', 4),
		('2022-06-15', 101, 30101, 503, 'ф417', 4),
		('2022-06-15', 101, 50101, 501, 'ф201', 5),
		('2022-06-15', 101, 50102, 501, 'ф201', 3),
		('2022-06-15', 103, 10101, 403, 'ф414', 4),
		('2022-06-15', 102, 10101, 102, 'т505', 5)
